{"title": " اکسل چیست و افراد مسلط به اکسل چقدر حقوق می گیرند؟ ", "short_link": "https://toplearn.com/b/3353", "body": "\n\nاکسل چیست و افراد مسلط به اکسل چقدر حقوق می گیرند؟ \n\nدر این مقاله پس از معرفی نرم افزار اکسل به بررسی جدیدترین آگهی های استخدامی  و تخمین میزان حقوق دریافتی افراد مسلط به اکسل می پردازیم.اکسل چیست؟     به زبان خودمانی، اکسل نرم افزاری آچارفرانسه با ابزارهای بسیار قدرتمند جهت استفاده در زمینه های گوناگون و مختلف مانند حسابداری  منابع انسانی، انبارداری، مدیریت پروژه، بانک اطلاعاتی، صندوق های فروشگاهی، تعیین برنامه های کسب و کار و ... می باشد.اکسل به دلیل داشتن سلول های بسیار زیاد در کنار یکدیگر، سیستمی را خلق می کند که با کمک فرمول نویسی، کدنویسی و تجزیه و تحلیل های نموداری می توان راه حل های بسیاری را برای حل مسائل گوناگون از دل آن خارج کرد. اتفاقی که تقریبا هیچ نرم افزاری حتی به گرد پای اکسل نمی رسد و نرم افزارهای مشابه هیچ کدام تا این حد منعطف نیستند و قابلیت شخصی سازی براساس نیاز هر پروژه را ندارند. توابعبا استفاده از توابع بسیار زیاد موجود در اکسل می توان جواب حل مسائل طولانی را در کسری از ثانیه بدست آورد، به عنوان مثال:عبارت = sum (d1: d50 ) حاصل جمع سلول d1 تا d50 را که شامل 50 سلول می باشند را بدست می آورد.عبارت = average ( e5 : e47 ) میانگین اعداد داخل سلول های e5  تا e47 را بدست می آورد.عبارت = max ( h8 : h96 ) بزرگترین عدد داخل سلول های h8 تا h96 را بدست می آورد.عبارت = product ( c6 : c156 ) حاصل ضرب اعداد داخل سلول های c6 تا c156 را بدست می آورد. زبان vba و ماکرونویسییکی دیگر از قسمت های جذاب اکسل که یادگیری آن آسان می باشد امکان کدنویسی با زبان قدرتمند vba  و ماکرونویسی می باشد، این زبان این امکان را به شما می دهد تا در کنار سایر فرمول نویسی ها و توابع موجود در اکسل، امکانات کاربردی با قابلیت شخصی سازی براساس نیاز هر پروژه را در آن ایجاد نمایید و با تعریف کدهای این زبان به بخش های کوچک تر و نام گذاری هر بخش واحدی به نام ماکرو ایجاد نمایید تا با زدن کلید های تعریف شده بر روی کیبورد یا محیط نرم افزار، عملیات مورد نظر اجرا شود. مثلا به عنوان حسابدار و یا مدیرمالی می توانید نرم افزار حسابداری متناسب با شرکت خود را پیاده سازی نمایید، به عنوان کارشناس و یا مدیر منابع انسانی پایگاه داده و بانک اطلاعاتی با ابزارهای مورد نیازتان را بسازید، به عنوان انباردار فهرستی پویا از انواع کالاهای موجود و ناموجود شرکت خود را با انواع ویژگی های گوناگون مانند نوع کالا، قیمت، کدکالا، آخرین وضعیت و ... تهیه نمایید، به عنوان مدیر پروژه باتوجه به المان های گوناگون موجود در پروژه تان بانک اطلاعاتی و فهرستی را بوجود آورید تا وضعیت واحدهای مختلف زیردست را برای شما به نمایش بگذارد.نمونه کدهای زبان vba جهت اضافه کردن قابلیت ارسال ایمیل در برنامه مورد نظرتان:Sub Send_Mail()\r\n    Dim OutApp As Object\r\n    Dim OutMail As Object\r\n    Set OutApp = CreateObject(\"Outlook.Application\")\r\n    Set OutMail = OutApp.CreateItem(0)\r\n    With OutMail\r\n        .to = \"test@test.com\"\r\n        .Subject = \"Test Email\"\r\n        .Body = \"Message Body\"\r\n        .Attachments.Add ActiveWorkbook.FullName\r\n        .Display\r\n    End With\r\n    Set OutMail = Nothing\r\n    Set OutApp = Nothing\r\nEnd Sub\r\nداشبورد سازیگل سر سبد در تسلط به نرم افزار اکسل، قابلیت ساخت داشبوردهای گوناگون و تجزیه تحلیل نموداری می باشد. داشبورد ها مانند داشبورد خودرو که در آن با علامت های مختلف آخرین وضعیت خودرو مانند سرعت، میزان باد تایرها، میزان سوخت، مسافت طی شده و ... برای ما به نمایش گذاشته می شود، با کمک داشبوردسازی در اکسل قابلیت های مشابه را می توانیم برای پروژه های خود تعریف نماییم. افراد مسلط به اکسل چقدر حقوق می گیرند؟در این قسمت به بررسی 5 مورد از جدیدترین و معتبرترین آگهی های شرکت هایی می پردازیم که برای استخدامی در این عناوین شغلی تسلط به نرم افزار اکسل شرط الزامی شما جهت بدست آوردن شغل می باشد و به صورت تقریبی براساس تجربیات میزان حقوق دریافتی را تخمین می زنیم، لازم به ذکر است مسیر پیشرفت و ارتقاء در عناوین شغلی مرتبط با نرم افزار اکسل در شرکت های مختلف به قدری جذاب است که لزوما نمی توان سقف مشخصی برای مهارت های مورد نیاز و حتی میزان درآمد تعریف کرد. عنوان شغلی : کارشناس ارشد تدوین طرح توجیهی (مدلسازی اقتصادی با اکسل یا کامفار)بزرگی شرکت : بین 11 تا 50 نفر کارمند      روز و ساعت کاری : 8 الی 17نوع همکاری : تمام وقتصنعت : تکنولوژی و نوآوریمهارت های مورد نیاز :- مسلط به مدل سازی مالی و اقتصادی در اکسل- توانایی تدوین طرح کسب و کار، مطالعات و تحقیقات بازار- آشنایی با مدل های کسب و کار و اکوسیستم استارتاپی- روابط عمومی بالا و توانایی تهیه گزارش های مدیریتیتخمین حقوق دریافتی : بین 5 تا 7 میلیون تومان در ماه غیر از پورسانت عنوان شغلی : کارشناس تحلیل دادهبزرگی شرکت : بین 200 تا 500 نفر کارمند      روز و ساعت کاری : 7 الی 16 ، پنج شنبه ها 7 الی 12نوع همکاری : تمام وقتصنعت : خرده فروشیمهارت های مورد نیاز :- مسلط به اکسل و داشبوردسازی- توانایی تجزیه و تحلیل داده ها- توانایی گزارش سازی- خلاق و صبورتخمین حقوق دریافتی : بین 6 تا 8 میلیون تومان در ماه عنوان شغلی : مدیر برنامه ریزی فروشبزرگی شرکت : مثبت 5000 نفر کارمند      روز و ساعت کاری : شنبه تا چهارشنبه 8 الی 18نوع همکاری : تمام وقتصنعت : کالاهای مصرفیمهارت های مورد نیاز :- مسلط به اکسل- تهیه و محاسبه طرح انگیزشی برای پرسنل فروش طراحی و تدوین راهبرهای فروش- آشنایی با مدل های ارزیابی فروش و بازاریابی- تهیه گزارشات داشبورد مدیریتیتخمین حقوق دریافتی : بین 8 تا 10 میلیون تومان در ماه عنوان شغلی : کارشناس برنامه ریزی استراتژیکبزرگی شرکت : بین 500 تا 1000 نفر کارمند      روز و ساعت کاری : شنبه تا چهارشنبه 8 الی 17نوع همکاری : تمام وقتصنعت : انرژیمهارت های مورد نیاز :- مسلط به اکسل و داشبوردسازی- توانایی تجزیه و تحلیل داده ها- مدیریت کیفیت- برنامه ریزی استراتژیکتخمین حقوق دریافتی : بین 6 تا 8 میلیون تومان در ماه عنوان شغلی : کارشناس اداریبزرگی شرکت : بین 11 تا 50 نفر کارمند      روز و ساعت کاری : طبق اداره کارنوع همکاری : تمام وقتصنعت : دارومهارت های مورد نیاز :- مسلط به اکسل و داشبوردسازی به صورت پیشرفته- آشنا با قوانین اداره کار و بیمه- مسلط به محاسبه حقوق و دستمزدتخمین حقوق دریافتی : بین 6 تا 7 میلیون تومان در ماه در صورتی که تصمیم به یادگیری نرم افزار اکسل و ورود به دنیای زیبای بازار کار را دارید، می توانید دوره آموزش جامع اکسل که با حمایت سایت تاپ لرن و تدریس اینجانب شامل 22 ساعت آموزش از مقدماتی تا پیشرفته  و رضایت 96 درصدی کاربران تهیه شده است را دنبال نمایید.\n", "author": " علی راست رو صرمی ", "view": "4799 بازدید", "created_at": "2021-8-17"}