{"title": " 10 ترفند ویژوال استودیو که باعث افزایش عملکرد شما می‌شود ", "short_link": "https://toplearn.com/b/ADpO", "body": "\n\n10 ترفند ویژوال استودیو که باعث افزایش عملکرد شما می‌شود \n\nویژوال استودیو شامل امکانات زیادی است و قابلیت های بسیار زیادی رو ارائه میکنه، که ما توی این مقاله 15 تا از این موارد رو معرفی خواهیم کرد. code cleanupاین قابلیت فرمت کد ها ، استایل و نحوه نمایش آن ها رو تغییر میده و باعث افزایش خوانایی کد های شما میشهمی‌توانید با کلیک کردن رو دکمه با آیکون جارو یا  ترکیب کلید های CTRL + K , CTRL + E این قابلیت رو مشاهده کنید.افزایش سرعت هنگام لود شدن پروژه  برای سرعت بخشیدن به اجرای پروژه خود میتوانید پروژه را با وضعیت فعلی و پکیج های موجود لود کنید. برای فعالسازی این قابلیت میتوانید مسیر زیر رو دنبال کنید:Tools >  Options > Project and Solutionsو تیک گزینه Restore Solution Explorer project hierarchy state on solution load رو بردارید.  جستجو در Watch WindowWatch Window شامل راهکار های پیشرفته ای برای برسی متغیر ها یا همان variable  ها میباشد.برای فعال کردن این ویژگی روی متغییر مورد نظر کلیک کنید یا از قسمت Data Tips گزینه Add To Watch List رو بزنید. حالا متغییر شما در پنجره Watch Window ظاهر شده است.در ویژوال استودیو 2019 شما میتوانید در این پنجره متغییر ها رو جستوجو کنید و به راحتی متغیر مورد نظرتون رو پیدا کنید.همچنین میتوانید با دوبار کلیک روی خط مورد نظر فرمت یا نوع اون رو شناسایی کنید.   نشان دادن وضعیت فایل active  در پنجره Solution Explorerوقتی شما مشغول کار روی یک فایلی هستید و اون فایل در قسمت تب ها باز هست و دارید کد نویسی میکنید، در قسمت Solution Explorer (همان جایی که تمام فایل ها یا پرونده های پروژه نمایش داده میشود.) فایل مورد نظر به حالت انتخاب شده درمی‌آید. در نتیجه با سوییچ کردن بین بقیه تب ها فایل ها در solution Explorer بصورت اکتیو نمایش داده خواهند شد.برای فعال کردن این ویژگی مسیر زیر را دنبال کنیدTools > Options > Projects and Solutions > Generalو گزینه Track Active Item in Solution Explorer را انتخاب کنید.Paste  کردن چند خطیوقتی که خطی یا موردی را کپی یا کات میکنید، ویژوال استودیو اون مورد رو در حافظه کلیپبورد ذخیره میکند. (تا 15 مورد را در رم میتواند نگهداری کند)با زدن کلید های ترکیبی CTRL + Shift + V میتوانید چند خط را به صورت همزامان paste  کنید.مرتب سازی فضای های نام یا Using هاروی یکی از آیتم ها که از فضای نام دیگری در کلاس جاری استفاده شده راست کلیک کنید و گزینه Remove and Sort Using رو انتخاب کنید تا تمامی فضا های نام استفاده شما مرتب شود.برای فعال سازی تنظیمات بیشتر و پیشرفته تر میتوانید گزینه Place ‘System’ directives first when sorting usings رو از آدرس Tools > Options > Text Editor > C# > Advanced فعال کنید.مدیریت فعال های متفرقه در برنامهبرخی اوقات ممکن است فایل هایی را  را در ویژوال استودیو باز کنیم یا در solution Explorer  قرار بدیم که جزو پروژه ما نیستند. قابلیتی که در اینجا برای ما فراهم شده، قابلیت گروهبندی این فایل ها تحت عنوان Miscellaneous هستش که میتوانید از مسیر Tools > Options > Environment > Documents گزینه Show Miscellaneous files in Solution Explorer check box. رو فعال کنید.          Run to Cursorبا این قابلیت میتوانید برنامه را از قسمتی که قصد دارید اجرا و دیباگ کنید. منتظر نباشید تا خط به خط کد ها اجرا شوند. برای استفاده از این قابلیت رو خطی میخواهید برنامه در هنگام دیباگ بایستد راست کلیک کنید و گزینه Run to Cursor رو انتخاب کنید.  همچنین میتوانید از کلید های ترکیبی CTRl + F10  استفاده کنید.استفاده مجدد از کد ها در Toolboxبرخی مواقع کد هایی در برنامه به صورت مکرر باید در قسمت های مختلف استفاده شود. برای جلوگیری از نوشتن تکراری کد میتوان کد مورد نظر رو انتخاب و توی پنجره Toolbox رها کنید. همچنین امکان گروهبندی کد ها نیز وجود دارد. اگر شما این تب رو در برنامه خود مشاهده نمیکنید به سادگی از مسیر view>Toolbox و یا همچنین با زدن کلید های ترکیبی CTRl + Alt+X میتوانید فعال کنید.نشان دادن پنجره Output Windowاگر میخواهید جزئیات خروجی برنامه (Output) پس از هر بار built  یا start برنامه باز شود گزینه Show Output window when build starts از مسیر Tools > Options > Project and Solutions فعال کنید.اجرا کردن برنامه تحت وب از طریق چندین مرورگرشما به عنوان یک توسعه دهنده نیاز دارید تا صحت عملکرد برنامه خود را در مرورگر های متفاوت اجرا کنید. برای تنظیم کردن این مورد از dropdown  دکمه اجرای برنامه گزینه Browse with  مرورگر دلخواه خود رو بعنوان پیش فرض Set as default  انتخاب کنید. اجرای سریعوقتی که پروژه بزرگ میشود دسترسی به فایل ها یا متغییر ها، متد ها و . . . کمی دشوار میشود. برای دسترسی آسان و سریع به موارد ذکر شده میتوانید از تب Edit  و گزینه Go To مشخص کنید که دنبال چه موردی میگردید. همچنین برای سرچ در فایل های برنامه میتوان از کلید ترکیبی CTRl + , و برای جستوجوی پراپرتی ها، متغییر ها، متد ها و غیره از کلید ترکیبی  CTRL + Tاستفاده کرد.\n", "author": " محمد اردوخانی ", "view": "1885 بازدید", "created_at": "2021-1-3"}